MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA702/mcu.h
extern volatile DMACH5BITS DMACH5bits __attribute__((__sfr__));

#define DMAINT5 DMAINT5
extern volatile uint16_t DMAINT5 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT5BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT5BITS;
extern volatile DMAINT5BITS DMAINT5bits __attribute__((__sfr__));

#define DMASRC5 DMASRC5
extern volatile uint16_t DMASRC5 __attribute__((__sfr__));
#define DMADST5 DMADST5
extern volatile uint16_t DMADST5 __attribute__((__sfr__));
#define DMACNT5 DMACNT5
extern volatile uint16_t DMACNT5 __attribute__((__sfr__));
#define PADCON PADCON
extern volatile uint16_t PADCON __attribute__((__sfr__));
typedef struct tagPADCONBITS {
  uint16_t PMPTTL:1;
  uint16_t :14;
  uint16_t IOCON:1;
} PADCONBITS;
extern volatile PADCONBITS PADCONbits __attribute__((__sfr__));

#define IOCSTAT IOCSTAT
extern volatile uint16_t IOCSTAT __attribute__((__sfr__));
typedef struct tagIOCSTATBITS {
  uint16_t IOCPAF:1;
  uint16_t IOCPBF:1;
  uint16_t IOCPCF:1;
} IOCSTATBITS;
extern volatile IOCSTATBITS IOCSTATbits __attribute__((__sfr__));

#define TRISA TRISA
extern volatile uint16_t TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile uint16_t ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  uint16_t ODCA0:1;
  uint16_t ODCA1:1;
  uint16_t ODCA2:1;
  uint16_t ODCA3:1;
  uint16_t ODCA4:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define ANSA ANSA
extern volatile uint16_t ANSA __attribute__((__sfr__));
__extension__ typedef struct tagANSABITS {
  union {
    struct {
      uint16_t ANSA0:1;
      uint16_t ANSA1:1;
      uint16_t ANSA2:1;
      uint16_t ANSA3:1;
    };
    struct {
      uint16_t ANSELA0:1;
      uint16_t ANSELA1:1;
      uint16_t ANSELA2:1;
      uint16_t ANSELA3:1;
    };
  };
} ANSABITS;
extern volatile ANSABITS ANSAbits __attribute__((__sfr__));

#define ANSELA ANSELA
extern volatile uint16_t ANSELA __attribute__((__sfr__));
__extension__ typedef struct tagANSELABITS {
  union {
    struct {
      uint16_t ANSA0:1;
      uint16_t ANSA1:1;
      uint16_t ANSA2:1;
      uint16_t ANSA3:1;
    };
    struct {
      uint16_t ANSELA0:1;
      uint16_t ANSELA1:1;
      uint16_t ANSELA2:1;
      uint16_t ANSELA3:1;
    };
  };
} ANSELABITS;
extern volatile ANSELABITS ANSELAbits __attribute__((__sfr__));

#define IOCPA IOCPA
extern volatile uint16_t IOCPA __attribute__((__sfr__));
typedef struct tagIOCPABITS {
  uint16_t IOCPA0:1;
  uint16_t IOCPA1:1;
  uint16_t IOCPA2:1;
  uint16_t IOCPA3:1;
  uint16_t IOCPA4:1;
} IOCPABITS;
extern volatile IOCPABITS IOCPAbits __attribute__((__sfr__));

#define IOCNA IOCNA
extern volatile uint16_t IOCNA __attribute__((__sfr__));
typedef struct tagIOCNABITS {
  uint16_t IOCNA0:1;
  uint16_t IOCNA1:1;
  uint16_t IOCNA2:1;
  uint16_t IOCNA3:1;
  uint16_t IOCNA4:1;
} IOCNABITS;
extern volatile IOCNABITS IOCNAbits __attribute__((__sfr__));

#define IOCFA IOCFA
extern volatile uint16_t IOCFA __attribute__((__sfr__));
typedef struct tagIOCFABITS {
  uint16_t IOCFA0:1;
  uint16_t IOCFA1:1;
  uint16_t IOCFA2:1;
  uint16_t IOCFA3:1;
  uint16_t IOCFA4:1;
} IOCFABITS;
extern volatile IOCFABITS IOCFAbits __attribute__((__sfr__));

#define CNPUA CNPUA
extern volatile uint16_t CNPUA __attribute__((__sfr__));
__extension__ typedef struct tagCNPUABITS {
  union {
    struct {
      uint16_t IOCPA0:1;
      uint16_t IOCPA1:1;
      uint16_t IOCPA2:1;
      uint16_t IOCPA3:1;
      uint16_t IOCPA4:1;
    };
    struct {
      uint16_t IOCPUA0:1;
      uint16_t IOCPUA1:1;
      uint16_t IOCPUA2:1;
      uint16_t IOCPUA3:1;
      uint16_t IOCPUA4:1;
    };
    struct {
      uint16_t CNPUA0:1;
      uint16_t CNPUA1:1;
      uint16_t CNPUA2:1;
      uint16_t CNPUA3:1;
      uint16_t CNPUA4:1;
    };
  };
} CNPUABITS;
extern volatile CNPUABITS CNPUAbits __attribute__((__sfr__));

#define IOCPUA IOCPUA
extern volatile uint16_t IOCPUA __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUABITS {
  union {
    struct {
      uint16_t IOCPA0:1;
      uint16_t IOCPA1:1;
      uint16_t IOCPA2:1;
      uint16_t IOCPA3:1;
      uint16_t IOCPA4:1;
    };
    struct {
      uint16_t IOCPUA0:1;
      uint16_t IOCPUA1:1;
      uint16_t IOCPUA2:1;
      uint16_t IOCPUA3:1;
      uint16_t IOCPUA4:1;
    };
    struct {
      uint16_t CNPUA0:1;
      uint16_t CNPUA1:1;
      uint16_t CNPUA2:1;
      uint16_t CNPUA3:1;
      uint16_t CNPUA4:1;
    };
  };
} IOCPUABITS;
extern volatile IOCPUABITS IOCPUAbits __attribute__((__sfr__));

#define CNPDA CNPDA
extern volatile uint16_t CNPDA __attribute__((__sfr__));
__extension__ typedef struct tagCNPDABITS {
  union {
    struct {
      uint16_t IOCPDA0:1;
      uint16_t IOCPDA1:1;
      uint16_t IOCPDA2:1;
      uint16_t IOCPDA3:1;
      uint16_t IOCPDA4:1;
    };
    struct {
      uint16_t CNPDA0:1;
      uint16_t CNPDA1:1;
      uint16_t CNPDA2:1;
      uint16_t CNPDA3:1;
      uint16_t CNPDA4:1;
    };
  };
} CNPDABITS;
extern volatile CNPDABITS CNPDAbits __attribute__((__sfr__));

