MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA702/mcu.h
#define _U2WTCL_WTC12_POSITION                   0x0000000C
#define _U2WTCL_WTC12_MASK                       0x00001000
#define _U2WTCL_WTC12_LENGTH                     0x00000001

#define _U2WTCL_WTC13_POSITION                   0x0000000D
#define _U2WTCL_WTC13_MASK                       0x00002000
#define _U2WTCL_WTC13_LENGTH                     0x00000001

#define _U2WTCL_WTC14_POSITION                   0x0000000E
#define _U2WTCL_WTC14_MASK                       0x00004000
#define _U2WTCL_WTC14_LENGTH                     0x00000001

#define _U2WTCL_WTC15_POSITION                   0x0000000F
#define _U2WTCL_WTC15_MASK                       0x00008000
#define _U2WTCL_WTC15_LENGTH                     0x00000001

#define _U2WTCH_WTCH_POSITION                    0x00000000
#define _U2WTCH_WTCH_MASK                        0x000000FF
#define _U2WTCH_WTCH_LENGTH                      0x00000008

#define _U2WTCH_WTC16_POSITION                   0x00000000
#define _U2WTCH_WTC16_MASK                       0x00000001
#define _U2WTCH_WTC16_LENGTH                     0x00000001

#define _U2WTCH_WTC17_POSITION                   0x00000001
#define _U2WTCH_WTC17_MASK                       0x00000002
#define _U2WTCH_WTC17_LENGTH                     0x00000001

#define _U2WTCH_WTC18_POSITION                   0x00000002
#define _U2WTCH_WTC18_MASK                       0x00000004
#define _U2WTCH_WTC18_LENGTH                     0x00000001

#define _U2WTCH_WTC19_POSITION                   0x00000003
#define _U2WTCH_WTC19_MASK                       0x00000008
#define _U2WTCH_WTC19_LENGTH                     0x00000001

#define _U2WTCH_WTC20_POSITION                   0x00000004
#define _U2WTCH_WTC20_MASK                       0x00000010
#define _U2WTCH_WTC20_LENGTH                     0x00000001

#define _U2WTCH_WTC21_POSITION                   0x00000005
#define _U2WTCH_WTC21_MASK                       0x00000020
#define _U2WTCH_WTC21_LENGTH                     0x00000001

#define _U2WTCH_WTC22_POSITION                   0x00000006
#define _U2WTCH_WTC22_MASK                       0x00000040
#define _U2WTCH_WTC22_LENGTH                     0x00000001

#define _U2WTCH_WTC23_POSITION                   0x00000007
#define _U2WTCH_WTC23_MASK                       0x00000080
#define _U2WTCH_WTC23_LENGTH                     0x00000001

#define _SPI1CON1_ENHBUF_POSITION                0x00000000
#define _SPI1CON1_ENHBUF_MASK                    0x00000001
#define _SPI1CON1_ENHBUF_LENGTH                  0x00000001

#define _SPI1CON1_SPIFE_POSITION                 0x00000001
#define _SPI1CON1_SPIFE_MASK                     0x00000002
#define _SPI1CON1_SPIFE_LENGTH                   0x00000001

#define _SPI1CON1_MCLKEN_POSITION                0x00000002
#define _SPI1CON1_MCLKEN_MASK                    0x00000004
#define _SPI1CON1_MCLKEN_LENGTH                  0x00000001

#define _SPI1CON1_DISSCK_POSITION                0x00000003
#define _SPI1CON1_DISSCK_MASK                    0x00000008
#define _SPI1CON1_DISSCK_LENGTH                  0x00000001

#define _SPI1CON1_DISSDI_POSITION                0x00000004
#define _SPI1CON1_DISSDI_MASK                    0x00000010
#define _SPI1CON1_DISSDI_LENGTH                  0x00000001

#define _SPI1CON1_MSTEN_POSITION                 0x00000005
#define _SPI1CON1_MSTEN_MASK                     0x00000020
#define _SPI1CON1_MSTEN_LENGTH                   0x00000001

#define _SPI1CON1_CKP_POSITION                   0x00000006
#define _SPI1CON1_CKP_MASK                       0x00000040
#define _SPI1CON1_CKP_LENGTH                     0x00000001

#define _SPI1CON1_SSEN_POSITION                  0x00000007
#define _SPI1CON1_SSEN_MASK                      0x00000080
#define _SPI1CON1_SSEN_LENGTH                    0x00000001

#define _SPI1CON1_CKE_POSITION                   0x00000008
#define _SPI1CON1_CKE_MASK                       0x00000100
#define _SPI1CON1_CKE_LENGTH                     0x00000001

#define _SPI1CON1_SMP_POSITION                   0x00000009
#define _SPI1CON1_SMP_MASK                       0x00000200
#define _SPI1CON1_SMP_LENGTH                     0x00000001

#define _SPI1CON1_MODE16_POSITION                0x0000000A
#define _SPI1CON1_MODE16_MASK                    0x00000400
#define _SPI1CON1_MODE16_LENGTH                  0x00000001

#define _SPI1CON1_MODE32_POSITION                0x0000000B
#define _SPI1CON1_MODE32_MASK                    0x00000800
#define _SPI1CON1_MODE32_LENGTH                  0x00000001

#define _SPI1CON1_DISSDO_POSITION                0x0000000C
#define _SPI1CON1_DISSDO_MASK                    0x00001000
#define _SPI1CON1_DISSDO_LENGTH                  0x00000001

#define _SPI1CON1_SPISIDL_POSITION               0x0000000D
#define _SPI1CON1_SPISIDL_MASK                   0x00002000
#define _SPI1CON1_SPISIDL_LENGTH                 0x00000001

#define _SPI1CON1_SPIEN_POSITION                 0x0000000F
#define _SPI1CON1_SPIEN_MASK                     0x00008000
#define _SPI1CON1_SPIEN_LENGTH                   0x00000001

#define _SPI1CON1_MODE_POSITION                  0x0000000A
#define _SPI1CON1_MODE_MASK                      0x00000C00
#define _SPI1CON1_MODE_LENGTH                    0x00000002

#define _SPI1CON1L_ENHBUF_POSITION               0x00000000
#define _SPI1CON1L_ENHBUF_MASK                   0x00000001
#define _SPI1CON1L_ENHBUF_LENGTH                 0x00000001

#define _SPI1CON1L_SPIFE_POSITION                0x00000001
#define _SPI1CON1L_SPIFE_MASK                    0x00000002
#define _SPI1CON1L_SPIFE_LENGTH                  0x00000001

#define _SPI1CON1L_MCLKEN_POSITION               0x00000002
#define _SPI1CON1L_MCLKEN_MASK                   0x00000004
#define _SPI1CON1L_MCLKEN_LENGTH                 0x00000001

#define _SPI1CON1L_DISSCK_POSITION               0x00000003
#define _SPI1CON1L_DISSCK_MASK                   0x00000008
#define _SPI1CON1L_DISSCK_LENGTH                 0x00000001

#define _SPI1CON1L_DISSDI_POSITION               0x00000004
#define _SPI1CON1L_DISSDI_MASK                   0x00000010
#define _SPI1CON1L_DISSDI_LENGTH                 0x00000001

#define _SPI1CON1L_MSTEN_POSITION                0x00000005
#define _SPI1CON1L_MSTEN_MASK                    0x00000020
#define _SPI1CON1L_MSTEN_LENGTH                  0x00000001

#define _SPI1CON1L_CKP_POSITION                  0x00000006
#define _SPI1CON1L_CKP_MASK                      0x00000040
#define _SPI1CON1L_CKP_LENGTH                    0x00000001

#define _SPI1CON1L_SSEN_POSITION                 0x00000007
#define _SPI1CON1L_SSEN_MASK                     0x00000080
#define _SPI1CON1L_SSEN_LENGTH                   0x00000001

