MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA702/mcu.h
#define _LATA_LATA1_POSITION                     0x00000001
#define _LATA_LATA1_MASK                         0x00000002
#define _LATA_LATA1_LENGTH                       0x00000001

#define _LATA_LATA2_POSITION                     0x00000002
#define _LATA_LATA2_MASK                         0x00000004
#define _LATA_LATA2_LENGTH                       0x00000001

#define _LATA_LATA3_POSITION                     0x00000003
#define _LATA_LATA3_MASK                         0x00000008
#define _LATA_LATA3_LENGTH                       0x00000001

#define _LATA_LATA4_POSITION                     0x00000004
#define _LATA_LATA4_MASK                         0x00000010
#define _LATA_LATA4_LENGTH                       0x00000001

#define _ODCA_ODCA0_POSITION                     0x00000000
#define _ODCA_ODCA0_MASK                         0x00000001
#define _ODCA_ODCA0_LENGTH                       0x00000001

#define _ODCA_ODCA1_POSITION                     0x00000001
#define _ODCA_ODCA1_MASK                         0x00000002
#define _ODCA_ODCA1_LENGTH                       0x00000001

#define _ODCA_ODCA2_POSITION                     0x00000002
#define _ODCA_ODCA2_MASK                         0x00000004
#define _ODCA_ODCA2_LENGTH                       0x00000001

#define _ODCA_ODCA3_POSITION                     0x00000003
#define _ODCA_ODCA3_MASK                         0x00000008
#define _ODCA_ODCA3_LENGTH                       0x00000001

#define _ODCA_ODCA4_POSITION                     0x00000004
#define _ODCA_ODCA4_MASK                         0x00000010
#define _ODCA_ODCA4_LENGTH                       0x00000001

#define _ANSA_ANSA0_POSITION                     0x00000000
#define _ANSA_ANSA0_MASK                         0x00000001
#define _ANSA_ANSA0_LENGTH                       0x00000001

#define _ANSA_ANSA1_POSITION                     0x00000001
#define _ANSA_ANSA1_MASK                         0x00000002
#define _ANSA_ANSA1_LENGTH                       0x00000001

#define _ANSA_ANSA2_POSITION                     0x00000002
#define _ANSA_ANSA2_MASK                         0x00000004
#define _ANSA_ANSA2_LENGTH                       0x00000001

#define _ANSA_ANSA3_POSITION                     0x00000003
#define _ANSA_ANSA3_MASK                         0x00000008
#define _ANSA_ANSA3_LENGTH                       0x00000001

#define _ANSA_ANSELA0_POSITION                   0x00000000
#define _ANSA_ANSELA0_MASK                       0x00000001
#define _ANSA_ANSELA0_LENGTH                     0x00000001

#define _ANSA_ANSELA1_POSITION                   0x00000001
#define _ANSA_ANSELA1_MASK                       0x00000002
#define _ANSA_ANSELA1_LENGTH                     0x00000001

#define _ANSA_ANSELA2_POSITION                   0x00000002
#define _ANSA_ANSELA2_MASK                       0x00000004
#define _ANSA_ANSELA2_LENGTH                     0x00000001

#define _ANSA_ANSELA3_POSITION                   0x00000003
#define _ANSA_ANSELA3_MASK                       0x00000008
#define _ANSA_ANSELA3_LENGTH                     0x00000001

#define _ANSELA_ANSA0_POSITION                   0x00000000
#define _ANSELA_ANSA0_MASK                       0x00000001
#define _ANSELA_ANSA0_LENGTH                     0x00000001

#define _ANSELA_ANSA1_POSITION                   0x00000001
#define _ANSELA_ANSA1_MASK                       0x00000002
#define _ANSELA_ANSA1_LENGTH                     0x00000001

#define _ANSELA_ANSA2_POSITION                   0x00000002
#define _ANSELA_ANSA2_MASK                       0x00000004
#define _ANSELA_ANSA2_LENGTH                     0x00000001

#define _ANSELA_ANSA3_POSITION                   0x00000003
#define _ANSELA_ANSA3_MASK                       0x00000008
#define _ANSELA_ANSA3_LENGTH                     0x00000001

#define _ANSELA_ANSELA0_POSITION                 0x00000000
#define _ANSELA_ANSELA0_MASK                     0x00000001
#define _ANSELA_ANSELA0_LENGTH                   0x00000001

#define _ANSELA_ANSELA1_POSITION                 0x00000001
#define _ANSELA_ANSELA1_MASK                     0x00000002
#define _ANSELA_ANSELA1_LENGTH                   0x00000001

#define _ANSELA_ANSELA2_POSITION                 0x00000002
#define _ANSELA_ANSELA2_MASK                     0x00000004
#define _ANSELA_ANSELA2_LENGTH                   0x00000001

#define _ANSELA_ANSELA3_POSITION                 0x00000003
#define _ANSELA_ANSELA3_MASK                     0x00000008
#define _ANSELA_ANSELA3_LENGTH                   0x00000001

#define _IOCPA_IOCPA0_POSITION                   0x00000000
#define _IOCPA_IOCPA0_MASK                       0x00000001
#define _IOCPA_IOCPA0_LENGTH                     0x00000001

#define _IOCPA_IOCPA1_POSITION                   0x00000001
#define _IOCPA_IOCPA1_MASK                       0x00000002
#define _IOCPA_IOCPA1_LENGTH                     0x00000001

#define _IOCPA_IOCPA2_POSITION                   0x00000002
#define _IOCPA_IOCPA2_MASK                       0x00000004
#define _IOCPA_IOCPA2_LENGTH                     0x00000001

#define _IOCPA_IOCPA3_POSITION                   0x00000003
#define _IOCPA_IOCPA3_MASK                       0x00000008
#define _IOCPA_IOCPA3_LENGTH                     0x00000001

#define _IOCPA_IOCPA4_POSITION                   0x00000004
#define _IOCPA_IOCPA4_MASK                       0x00000010
#define _IOCPA_IOCPA4_LENGTH                     0x00000001

#define _IOCNA_IOCNA0_POSITION                   0x00000000
#define _IOCNA_IOCNA0_MASK                       0x00000001
#define _IOCNA_IOCNA0_LENGTH                     0x00000001

#define _IOCNA_IOCNA1_POSITION                   0x00000001
#define _IOCNA_IOCNA1_MASK                       0x00000002
#define _IOCNA_IOCNA1_LENGTH                     0x00000001

#define _IOCNA_IOCNA2_POSITION                   0x00000002
#define _IOCNA_IOCNA2_MASK                       0x00000004
#define _IOCNA_IOCNA2_LENGTH                     0x00000001

#define _IOCNA_IOCNA3_POSITION                   0x00000003
#define _IOCNA_IOCNA3_MASK                       0x00000008
#define _IOCNA_IOCNA3_LENGTH                     0x00000001

#define _IOCNA_IOCNA4_POSITION                   0x00000004
#define _IOCNA_IOCNA4_MASK                       0x00000010
#define _IOCNA_IOCNA4_LENGTH                     0x00000001

#define _IOCFA_IOCFA0_POSITION                   0x00000000
#define _IOCFA_IOCFA0_MASK                       0x00000001
#define _IOCFA_IOCFA0_LENGTH                     0x00000001

#define _IOCFA_IOCFA1_POSITION                   0x00000001
#define _IOCFA_IOCFA1_MASK                       0x00000002
#define _IOCFA_IOCFA1_LENGTH                     0x00000001

#define _IOCFA_IOCFA2_POSITION                   0x00000002
#define _IOCFA_IOCFA2_MASK                       0x00000004
#define _IOCFA_IOCFA2_LENGTH                     0x00000001

